per1234/InoPlatformPropertiesTest/dummy_architecture/boards.txt
# See: https://arduino.github.io/arduino-cli/dev/platform-specification/#boardstxt

menu.dummy_menu_id=Dummy Menu Title

dummy_board.name=InoPlatformPropertiesTest

dummy_board.upload.tool=dummy_tool
dummy_board.upload.protocol=dummy_protocol

dummy_board.bootloader.tool=dummy_tool

dummy_board.build.core=dummy_core
dummy_board.build.variant=dummy_variant
dummy_board.build.board=DUMMY_ARCHITECTURE_DUMMY_BOARD
dummy_board.build.mcu=atmega328p

dummy_board.debug.tool=dummy_debug_tool

dummy_board.dummy_boards_property=dummy_boards_property_value
dummy_board.dummy_override_property=dummy_override_property_value_boards

# Custom board option overrides this, despite the default property's position in the file
dummy_board.dummy_option_property=dummy_option_property_value_default_1

# See: https://arduino.github.io/arduino-cli/dev/platform-specification/#custom-board-options
# When used with the Arduino IDE, the menu selection will be saved to the dummy_option_property property in preferences.txt on exit
dummy_board.menu.dummy_menu_id.dummy_option_id_1=Dummy Option 1 Text
dummy_board.menu.dummy_menu_id.dummy_option_id_1.dummy_option_property=dummy_option_property_value_1
dummy_board.menu.dummy_menu_id.dummy_option_id_2=Dummy Option 2 Text
dummy_board.menu.dummy_menu_id.dummy_option_id_2.dummy_option_property=dummy_option_property_value_2

# Custom board option overrides this, despite the default property's position in the file
dummy_board.dummy_option_property=dummy_option_property_value_default_2

dummy_board.dummy_board_property_list=software={software} name={name} _id={_id} extra.time.utc={extra.time.utc} extra.time.local={extra.time.local} extra.time.zone={extra.time.zone} extra.time.dst={extra.time.dst} runtime.platform.path={runtime.platform.path} runtime.hardware.path={runtime.hardware.path} runtime.ide.path={runtime.ide.path} runtime.ide.version={runtime.ide.version} ide_version={ide_version} runtime.os={runtime.os} build.path={build.path} build.project_name={build.project_name} build.arch={build.arch} build.core={build.core} build.core.path={build.core.path} build.system.path={build.system.path} build.fqbn={build.fqbn} build.variant={build.variant} build.variant.path={build.variant.path} build.source.path={build.source.path} build.library_discovery_phase={build.library_discovery_phase} includes={includes} source_file={source_file} object_file={object_file} archive_file_path={archive_file_path} archive_file={archive_file} object_files={object_files} preprocessed_file_path={preprocessed_file_path} sketch_path={sketch_path} compiler.libraries.ldflags={compiler.libraries.ldflags} compiler.optimization_flags={compiler.optimization_flags} upload.verbose={upload.verbose} upload.verify={upload.verify} serial.port={serial.port} serial.port.file={serial.port.file} program.verbose={program.verbose} program.verify={program.verify} program.extra_params={program.extra_params} erase.verbose={erase.verbose}  erase.verify={erase.verify} bootloader.verbose={bootloader.verbose} bootloader.verify={bootloader.verify} upload.network.port={upload.network.port} upload.network.endpoint_upload={upload.network.endpoint_upload} upload.network.endpoint_sync={upload.network.endpoint_sync} upload.network.endpoint_reset={upload.network.endpoint_reset} upload.network.sync_return={upload.network.sync_return} interpreter={interpreter} dummy_boards_property={dummy_boards_property} dummy_boards_local_property={dummy_boards_local_property} dummy_programmer_property={dummy_programmer_property} dummy_platform_property={dummy_platform_property} dummy_platform_local_property={dummy_platform_local_property} dummy_tool_property={dummy_tool_property} dummy_tool_local_property={dummy_tool_local_property} dummy_override_property={dummy_override_property} dummy_option_property={dummy_option_property}
